app/views/targets/index.html.erb

		    			<th>現在の貯金額</th>
		    			<td><%= target.target_items.sum(:target_by_month) %>円</td>
---
SELECT `targets`.* FROM `targets`


		     <% loan.loan_items.each do |loan_item| %>
---
SELECT `loans`.* FROM `loans`