app/controllers/calendar_incomes_controller.rb

SELECT SUM(`incomes`.`income`) AS sum_income, `incomes`.`day` AS incomes_day FROM `incomes` WHERE `incomes`.`created_at` BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59' AND `incomes`.`user_id` = 2 GROUP BY `incomes`.`day`
SELECT SUM(`proportial_costs`.`proportial_cost`) AS sum_proportial_cost, `proportial_costs`.`day` AS proportial_costs_day FROM `proportial_costs` WHERE `proportial_costs`.`created_at` BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59' AND `proportial_costs`.`user_id` = 2 GROUP BY `proportial_costs`.`day`
---
  def total
    @incomes = current_user.incomes
   		.where(created_at: Time.now.beginning_of_month..Time.now.end_of_month)
   		.where(user_id: current_user.id)
   		.group(:day)
   		.sum(:income)

  	@proportial_costs = current_user.proportial_costs
   		.where(created_at: Time.now.beginning_of_month..Time.now.end_of_month)
   		.where(user_id: current_user.id)
   		.group(:day)
   		.sum(:proportial_cost)