app/controllers/communications_controller.rb

  def new
    if FixedCost.exists?(user_id: current_user.id)
---
SELECT  1 AS one FROM `fixed_costs` WHERE `fixed_costs`.`user_id` = 2 LIMIT 1