app/controllers/costs_controller.rb

  def index
    if current_user.fixed_cost == nil
       redirect_to homes_top_path
    else
    	@proportial_cost0 = current_user.proportial_costs.where(proportial_cost_item: "食費", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:proportial_cost)
    	@proportial_cost1 = current_user.proportial_costs.where(proportial_cost_item: "交通費", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:proportial_cost)
    	@proportial_cost2 = current_user.proportial_costs.where(proportial_cost_item: "交際費", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:proportial_cost)
    	@proportial_cost3 = current_user.proportial_costs.where(proportial_cost_item: "日用品", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:proportial_cost)

    	@fixed_cost = current_user.fixed_cost

      @fixed_costs = current_user.fixed_cost.rent.to_i + current_user.fixed_cost.insurance.to_i + current_user.fixed_cost.fixed_costs_other.to_i

    	@communications = Communication.where(fixed_cost_id: current_user.fixed_cost.id,created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:phone)+ Communication.where(fixed_cost_id: current_user.fixed_cost.id, created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:wi_fi)+ Communication.where(fixed_cost_id: current_user.fixed_cost.id ,created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:communications_other)

      @lifelines = Lifeline.where(user_id: current_user.id, created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:electron)+ Lifeline.where(user_id: current_user.id, created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:gass)+ Lifeline.where(user_id: current_user.id, created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:water)
---
SELECT SUM(`proportial_costs`.`proportial_cost`) FROM `proportial_costs` WHERE `proportial_costs`.`proportial_cost_item` = 0 AND `proportial_costs`.`created_at` BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59'
SELECT  `fixed_costs`.* FROM `fixed_costs` WHERE `fixed_costs`.`user_id` = 1 LIMIT 1