app/controllers/goals_controller.rb

  def new
  	if current_user.goals.empty?
---
SELECT  1 AS one FROM `goals` WHERE `goals`.`user_id` = 2 LIMIT 1