app/controllers/incomes_controller.rb

SELECT SUM(`incomes`.`income`) FROM `incomes` WHERE `incomes`.`income_item` = 0 AND `incomes`.`created_at` BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59'
SELECT SUM(`incomes`.`income`) FROM `incomes` WHERE `incomes`.`created_at` BETWEEN '2020-03-01 00:00:00' AND '2020-03-31 23:59:59'
---
  def index
   @incomes0 = Income.where(income_item: "給料", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:income)
   @incomes1 = Income.where(income_item: "手当て", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:income)
   @incomes2 = Income.where(income_item: "退職金", created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:income)
   @incomes3 = Income.where(income_item: "その他",created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:income)
                                                             # @income.created_at.beginning_of_month..Time.now.end_of_month).sum(:income)
   @imcomes = Income.where(created_at: Time.now.beginning_of_month..Time.now.end_of_month).sum(:income)