app/controllers/targets_controller.rb

  def index
    if FixedCost.exists?(user_id: current_user.id)
      @targets = current_user.targets
      @target_item = TargetItem.new
      @loans = Loan.where(fixed_cost_id: current_user.fixed_cost.id)

      if @targets.empty? && @loans.empty?
---
SELECT `loans`.* FROM `loans`
SELECT `targets`.* FROM `targets`